out/brain/hello-new.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-01-27 Thu 18:12 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Moving to Emacs</title>
<meta name="author" content="David Noronha" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/assets/styles.css" />
</head>
<body>
<nil id="nil" class="content">
<header>
<h1 class="title">Moving to Emacs</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb457839">1. Setting up Org mode</a></li>
</ul>
</div>
</nav>
<p>
So recently out of frustration with developing on windows, I took it into my hands and reinstalled Linux,
In this case  <a href="https://voidlinux.org/">Void Linux</a> for the new year.
To go along with the drastic change, I decided to finally move to Emacs&#x2026;
And this is my experiance with it.
</p>

<section id="outline-container-orgb457839" class="outline-2">
<h2 id="orgb457839"><span class="section-number-2">1.</span> Setting up Org mode</h2>
<div class="outline-text-2" id="text-1">
<p>
There's no way I'd use emacs without at least trying out org mode and I love it very much,
I might use it to replace my messy  <a href="../lorem.html">nesdown</a> thing entirely, because it does the same things I imagined
and in a better way too,
</p>

<ul class="org-ul">
<li>Write once export to many formats seamlessly without looking out of place</li>
<li>Decent syntax that doesnt require to remember a lot</li>
<li>Interactive features if required</li>
<li><p>
WYSIWYG but much more powerful
</p>

<p>
Of course by default, its nothing much to look at, but that can be easily rectified,
Org can do a really good job of hiding syntax till you absolutley need it, eg:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> org-hide-leading-stars t
      org-hide-emphasis-markers t
      org-hide-macro-markers t
      org-link-descriptive t)
</pre>
</div>

<p>
Also to get syntax highlighting in source blocks,
use <code>org-fontify</code>
</p>

<p>
(You can find any more by doing M-x RET customize-group RET org-appearance)
</p></li>
</ul>

<p>
The plugins I used are:
</p>
<ul class="org-ul">
<li>org-superstar-mode - This allows me to customize header and list bullets as I please</li>
<li><p>
pretty-symbols-mode - This allows to me to display bits of syntax in the way I want, for example <code>lambda</code> becomes lambda.
It is designed for one charachter but I use this hack which allows me to use multiple charachters in a string
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">All credit to https://emacs.stackexchange.com/questions/34808/using-prettify-symbols-with-strings-instead-of-characters</span>
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/add-visual-replacement</span> (from to)
(<span style="font-weight: bold;">push</span> (cons from (<span style="font-weight: bold;">let</span> ((composition nil))
                    (<span style="font-weight: bold;">dolist</span> (char (string-to-list to)
                                (nreverse (cdr composition)))
                    (<span style="font-weight: bold;">push</span> char composition)
                    (<span style="font-weight: bold;">push</span> '(Br . Bl) composition))))
    prettify-symbols-alist))
</pre>
</div></li>

<li>variable-pitch-mode - Nothing special but allows me to switch the default font for a buffer</li>
</ul>

<p>
I also like to indent all the content with its appropriate heading,
<code>(setq org-startup-indented t)</code> does exactly that
</p>

<p>
Another nice thing is LATEX preview right in the document, which I find very cool
tho I do not use latex that often
\[
I = \frac{ml^2 sin^2 \theta}{3}
\]
I know its oversized but it took so long to work right since latex bad.
</p>

<p>
And almost all of this is seamlessly exported to whatever format you choose if it supports all of it,
In this case, HTML does.
</p>

<p>
Modifying my SSG to work with org was relativley simple too.
</p>
</div>
</section>
</nil>
</body>
</html>
